КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СценарииАвтоматическойРаботы/КонтурЛогистика_СценарииАвтоматическойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_СценарииАвтоматическойРаботы</name>
  <attributes>
    <name>ПорядокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииАвтоматическойРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛогистическогоДокумента</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертации</name>
    <comment>может отсутствовать - определяет настройку конвертации для которой применять сценарий</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокГрузоотправителейВариантФильтрации</name>
    <comment>если установлен - значит табличная часть со списком организаций должна работать по принципу &quot;все кроме указанных&quot;</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПеревозчиковВариантФильтрации</name>
    <comment>если установлен - значит табличная часть со списком перевозчиков должна работать по принципу &quot;все кроме указанных&quot;</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокГрузополучателейВариантФильтрации</name>
    <comment>если установлен - значит табличная часть со списком организаций должна работать по принципу &quot;все кроме указанных&quot;</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПунктовМаршрутаОтправкиВариантФильтрации</name>
    <comment>если установлен - значит табличная часть с пунктами маршрутов должна работать по принципу &quot;все кроме указанных&quot;</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПунктовМаршрутаПрибытияВариантФильтрации</name>
    <comment>если установлен - значит табличная часть с пунктами маршрутов должна работать по принципу &quot;все кроме указанных&quot;</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокСостоянийДокументооборотаВариантФильтрации</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
    </type>
  </attributes>
  <attributes>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениЗадачЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениЗадачЧасовВБудущее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеУсловиеГДЕ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеУсловиеГДЕОбработкаОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеУсловиеГДЕВычислениеПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Настройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеУсловиеНа1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоБезЗамечанийУчастников</name>
    <comment>не будет выполнять автоотправку если есть замечания водителя или в пердыдущем титуле есть &quot;нештатные&quot; особенности</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИнтервалыАктивности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерезаполнятьЧерновики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаОтказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУведомленияОшибокРоботов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочтыУведомленияОшибокРоботов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецСценарий</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпецСценарииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокГрузоотправителейДиадок</name>
    <comment>Список организаций ГО по которым будет применяться сценарий</comment>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПеревозчиковДиадок</name>
    <comment>Список организаций ПВ по которым будет применяться сценарий</comment>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокГрузополучателейДиадок</name>
    <comment>Список организаций ГП по которым будет применяться сценарий</comment>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПунктовМаршрутаОтправки</name>
    <comment>Список пунктов маршрута отправки по которым будет применяться сценарий</comment>
    <attributes>
      <name>ПунктМаршрута</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПунктовМаршрутаПрибытия</name>
    <comment>Список пунктов маршрута прибытия по которым будет применяться сценарий</comment>
    <attributes>
      <name>ПунктМаршрута</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокСостоянийДокументооборота</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнтервалыАктивности</name>
    <attributes>
      <name>ВремяС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПН</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СБ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВариантыФильтрации/КонтурЛогистика_ВариантыФильтрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВариантыФильтрации</name>
  <enumValues>
    <name>ВсеБезОтбора</name>
  </enumValues>
  <enumValues>
    <name>УказатьСписок</name>
  </enumValues>
  <enumValues>
    <name>ВсеКромеУказанных</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииАвтоматическойРаботы/КонтурЛогистика_СценарииАвтоматическойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииАвтоматическойРаботы</name>
  <enumValues>
    <name>ВводЧерновиковДокументов</name>
  </enumValues>
  <enumValues>
    <name>ВводЧерновиковИПодготовкаКОтправкеНеподписанных</name>
  </enumValues>
  <enumValues>
    <name>ВводЧерновиковИОтправкаНеподписанных</name>
  </enumValues>
  <enumValues>
    <name>ВводЧерновиковПодписьИПодготовкаКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ВводЧерновиковПодписьИОтправка</name>
  </enumValues>
  <enumValues>
    <name>ВводДокументовУчетнойСистемыИзВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПодписьРанееОтправленного</name>
  </enumValues>
  <enumValues>
    <name>ПодписьВходящихДокументов</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДокументов</name>
  </enumValues>
  <enumValues>
    <name>ДействияПриИзмененииСтатусаДокументооборота</name>
  </enumValues>
  <enumValues>
    <name>СвойАлгоритм</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьВходящиеДокументыЛогистики</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_СценарииАвтоматическойРаботы/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокГрузоотправителейВариантФильтрации) Тогда 
		СписокГрузоотправителейВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокПеревозчиковВариантФильтрации) Тогда 
		СписокПеревозчиковВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокГрузополучателейВариантФильтрации) Тогда 
		СписокГрузополучателейВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокПунктовМаршрутаОтправкиВариантФильтрации) Тогда 
		СписокПунктовМаршрутаОтправкиВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокПунктовМаршрутаПрибытияВариантФильтрации) Тогда 
		СписокПунктовМаршрутаПрибытияВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(СписокСостоянийДокументооборотаВариантФильтрации) Тогда 
		СписокСостоянийДокументооборотаВариантФильтрации = Перечисления.КонтурЛогистика_ВариантыФильтрации.ВсеБезОтбора;
	КонецЕсли;
	
	ЕстьИнтервалыАктивности = ИнтервалыАктивности.Количество() > 0;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Найти(ДополнительноеУсловиеГДЕ, "&Параметр") > 0
		И Не ЗначениеЗаполнено(ДополнительноеУсловиеГДЕВычислениеПараметра)
		И Не ЗначениеЗаполнено(ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки) Тогда
		
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить вычисление параметра дополнительного условия.";
		ПараметрыСообщения.ПутьКДанным  = "Объект.ДополнительноеУсловиеГДЕПараметрИзЗначенияНастройки";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если (Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковДокументов
		Или Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИОтправкаНеподписанных
		Или Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковИПодготовкаКОтправкеНеподписанных
		Или Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИОтправка
		Или Сценарий = Перечисления.КонтурЛогистика_СценарииАвтоматическойРаботы.ВводЧерновиковПодписьИПодготовкаКОтправке)
		И ТипЛогистическогоДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		И ОбработкаОтказа
		И Не ЗначениеЗаполнено(ДополнительноеУсловиеГДЕОбработкаОтказа) Тогда
		
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить вычисление дополнительного условия";
		ПараметрыСообщения.ПутьКДанным  = "Объект.ДополнительноеУсловиеГДЕОбработкаОтказа";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
